In [1]:
import pandas as pd
import requests

In [3]:
df_tourism = pd.read_csv('tourism_dataset.csv')

In [4]:
df_tourism.head()

,Location,Country,Category,Visitors,Rating,Revenue,Accommodation_Available
0,kuBZRkVsAR,India,Nature,948853,1.32,84388.38,Yes
1,aHKUXhjzTo,USA,Historical,813627,2.01,802625.60,No
2,dlrdYtJFTA,Brazil,Nature,508673,1.42,338777.11,Yes
3,DxmlzdGkHK,Brazil,Historical,623329,1.09,295183.60,Yes
4,WJCCQlepnz,France,Cultural,124867,1.43,547893.24,No

In [5]:
df_tourism.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5989 entries, 0 to 5988
Data columns (total 7 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Location                 5989 non-null   object
 1   Country                  5989 non-null   object
 2   Category                 5989 non-null   object
 3   Visitors                 5989 non-null   int64
 4   Rating                   5989 non-null   float64
 5   Revenue                  5989 non-null   float64
 6   Accommodation_Available  5989 non-null   object
dtypes: float64(2), int64(1), object(4)
memory usage: 327.7+ KB

In [6]:
print(df_tourism)

        Location Country    Category  Visitors  Rating    Revenue  \
0     kuBZRkVsAR   India      Nature    948853    1.32   84388.38
1     aHKUXhjzTo     USA  Historical    813627    2.01  802625.60
2     dlrdYtJFTA  Brazil      Nature    508673    1.42  338777.11
3     DxmlzdGkHK  Brazil  Historical    623329    1.09  295183.60
4     WJCCQlepnz  France    Cultural    124867    1.43  547893.24
...          ...     ...         ...       ...     ...        ...
5984  xAzwnVKAqz     USA       Urban    828137    1.97  132848.78
5985  IfKotyaJFC  France      Nature    276317    3.53  325183.96
5986  bPyubCWGgA   Egypt       Beach    809198    3.37  927336.50
5987  kkWIucpBnu   Egypt    Cultural    808303    2.52  115791.43
5988  gHXUrdticm  France    Cultural     40939    4.65  957026.85

     Accommodation_Available
0                        Yes
1                         No
2                        Yes
3                        Yes
4                         No
...                      ...
5984                      No
5985                     Yes
5986                      No
5987                     Yes
5988                     Yes

[5989 rows x 7 columns]